Revit 2027 API
LightFamily.GetLightType Method
 Return a LightType object for the light type at the given index
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LightType GetLightType(
	int index
)
Public Function GetLightType (
	index As Integer
) As LightType
public:
LightType^ GetLightType(
	int index
)
member GetLightType :
        index : int -> LightType
Parameters
index Int32
 The index of the light type
Return Value
LightType
 A LightType object for the light type at the given index
Exceptions
Exception | Condition
ArgumentException |  The index is the argument that is being validated The index is not valid because it does not correspond to a valid light type
See Also
Reference
LightFamily Class
Autodesk.Revit.DB.Lighting Namespace